### Panda Basics 
* read csv 
* How to read specific number of rows into dataframe 
* Export df to csv file on the disk 
* Create DataFame from Dict 
* Create a DataFrame from List 
* DataFrame and Series

In [115]:
import pandas as pd

In [118]:
from pathlib import Path

In [119]:
fileName=Path('data/MFG10YearTerminationData.csv')

In [126]:
df = pd.read_csv(fileName, nrows=3,usecols=['EmployeeID','recorddate_key'])

In [127]:
df

   EmployeeID   recorddate_key
0        1318  12/31/2006 0:00
1        1318  12/31/2007 0:00
2        1318  12/31/2008 0:00

In [128]:
student_marks={'Alex':[10,30],
              'Denis':[30,50],
              'Charls':[50,80]}

In [129]:
type(student_marks)

dict

In [130]:
df1 = pd.DataFrame(student_marks)

In [131]:
df1

   Alex  Denis  Charls
0    10     30      50
1    30     50      80

In [132]:
student_names=['Alex','Denis','Charls']

In [133]:
type(student_names)

list

In [136]:
df2 = pd.DataFrame(student_names,columns=['Name'])

In [137]:
df2

     Name
0    Alex
1   Denis
2  Charls

In [138]:
df1

   Alex  Denis  Charls
0    10     30      50
1    30     50      80

In [144]:
type(df1['Alex'])

pandas.core.series.Series

In [145]:
df1.to_csv('names.csv')